<p> Система управления содержимым (контентом) (англ. Content management system, CMS) — информационная система или компьютерная программа, используемая для обеспечения и организации совместного процесса создания, редактирования и управления контентом (то есть содержимым).</p>
<p> Основные функции CMS:
  <br/>
  <ul>
    <li>Предоставление инструментов для создания содержимого, организация совместной работы над содержимым,</li>
    <li>Управление содержимым: хранение, контроль версий, соблюдение режима доступа, управление потоком документов и т. п.,</li>
    <li>Публикация содержимого,</li>
    <li>Представление информации в виде, удобном для навигации, поиска.</li>
  </ul>
</p>
<p> В системе управления содержимым могут находиться самые различные данные: документы, фильмы, фотографии, номера телефонов, научные данные и так далее. Такая система часто используется для хранения, управления, пересмотра и публикации документации. Контроль версий является одним из основных её преимуществ, когда содержимое изменяется группой лиц.</p>